app/controllers/api/restaurants_controller.rb

    def index
        # debugger
        @restaurants = Restaurant.all
---
SELECT  "restaurants".* FROM "restaurants" ORDER BY "restaurants"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def show
        @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]