app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "5Xk_EAHgAjzHk0G6CYhogA"], ["updated_at", "2022-06-21 21:03:41.121665"], ["id", 6]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save