app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ltJdfVPBE5gmVVRhXyvOPg"], ["updated_at", "2022-06-20 16:30:32.031901"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save